Revit 2027 API
BuiltInFailures.FamilyFailures.CannotSplitWhileBackgroundTasksAreInProgress Property
 Cannot split element while background tasks are in progress.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotSplitWhileBackgroundTasksAreInProgress { get; }
Public Shared ReadOnly Property CannotSplitWhileBackgroundTasksAreInProgress As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotSplitWhileBackgroundTasksAreInProgress {
	FailureDefinitionId^ get ();
}
static member CannotSplitWhileBackgroundTasksAreInProgress : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace